Revit 2027 API
View.CanModifyDisplayStyle Method
 Indicates if DisplayStyle can be modified.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanModifyDisplayStyle()
Public Function CanModifyDisplayStyle As Boolean
public:
bool CanModifyDisplayStyle()
member CanModifyDisplayStyle : unit -> bool
Return Value
Boolean
 True if DisplayStyle can be modified.
See Also
Reference
View Class
Autodesk.Revit.DB Namespace